开始时间：
结束时间：

-- 1、查询姓“猴”的学生名单
-- 1.1查询姓名中最后一个字是聪的学生名单
-- 1.2查询姓名中带猴的学生名单
-- 1.3、查询姓“孟”老师的个数
--2、查询课程编号为“0002”的总成绩

-- 2.1、查询选了课程的学生人数

-- 3、查询各科创建最高和最低分数
-- 3.1、查询每门课程被选修学生数

-- 3.2、查询男生，女生人数

-- 4、查询平均成绩大于70分学生的学号和平均成绩

-- 4.1、查询至少选修两门课程的学生学好

-- 4.2、查询同名同性学生名单并统计同名人数

-- 4.3、查询不及格的课程并按课程号从大到小排列

-- 4.4、查询每门课程的平均成绩，结果按平均成绩升序排序，平均成绩相同时，按课程号降序排列

-- 4.5、检索课程编号为“0004”且分数小于60的学生学号，结果按按分数降序排列

--4.6、统计每门课程的学生选修人数(超过2人的课程才统计)
--要求输出课程号和选修人数，查询结果按人数降序排序，若人数相同，按课程号升序排序

-- 4.7、查询两门以上不及格课程的同学的学号及其平均成绩

-- 5、查询学生的总成绩并进行排序

-- 5.1、查询平均成绩大于60分的学生学号和平均成绩        19


