
-- 6、查询所有课程成绩小于80分学生的学号、姓名
-- 6.1、查询没有学全所有课的学生的学号、姓名
--6.2、查询出只选修了两门课程的全部学生的学号和姓名
-- 7.查询所有学生的学号、姓名、选课数、总成绩
-- 7.2、查询学生的选课情况：学号，姓名，课程号，课程名称
-- 7.3、查询出每门课程的及格人数和不及格人数（***）
-- 7.4、使用分段[100-85],[85-70],[70-60],[<60]来统计各科成绩，分别统计：各分数段人数，课程号和课程名称

--9.1、检索0001课程分数小于90，按照分数降序排列的学生信息
-- 9.2、查询不同老师所教授不同课程平均分从高到低显示
-- 9.4、查询任何一门课程成绩在70分以上的姓名、课程名称和分数（与上题类似）
-- 9.5、查询两门及其以上不及格课程的同学的学号，姓名及其平均成绩

-- 12.6、查询课程编号为“0001”的课程比“0002”的课程成绩等于或者低的所有学生的学号，成绩，和课程号
-- 12.7、查询学过“孟扎扎”老师所教的所有课的同学的学号、姓名
-- 12.8、查询没学过"孟扎扎"老师讲授的任一门课程的学生姓名  
     

